@containerscrew, @danielewood why is this issue marked as completed?
https://github.com/containerscrew/tftools/pull/6 doesn't consist any logic related to output changes if I understand correctly.

I've tested it:


```
$ terraform plan
Terraform will perform the following actions:

  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "foo!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.bar"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + output1 = "test2"
```


```
$ ./tftools version                                                                                                                                                                     ─╯
tftools: v0.9.0 with go version go1.22.2 darwin/arm64
$ ./tftools summarize --show-tags --show-unchanged --compact <plan.json                                                                                                                 ─╯
🟢 Create:
  + local_file.foo
```